avrxml/asf/thirdparty/wireless/avr2025_mac/source/tal/atmegarfr2/inc/atmega256rfr2.h
/* This file is auto-generated. Do not modify manually! */

/**
 * @file atmega256rfr2.h
 *
 * @brief File contains register and command defines specific for ATMEGA256RFR2.
 *
 * Copyright (c) 2013-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

/*
 * Copyright (c) 2013-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under Atmel's Limited License Agreement --> EULA.txt
 */

/* Prevent double inclusion */
#ifndef ATMEGA256RFR2_H
#define ATMEGA256RFR2_H

/* === INCLUDES ============================================================ */

#include "tal_types.h"
#if (TAL_TYPE == ATMEGARFR2)

#define TRANSCEIVER_NAME    "ATMEGARFR2"
/* === EXTERNALS =========================================================== */

/* === TYPES =============================================================== */

/* === MACROS ============================================================== */

/** Parameter definitions */

/** deactivate macros defined in iom header file */
#undef                       P_ON
#undef                       BUSY_RX
#undef                       BUSY_TX
#undef                       RX_ON
#undef                       TRX_OFF
#undef                       PLL_ON
#undef                       BUSY_RX_AACK
#undef                       BUSY_TX_ARET
#undef                       RX_AACK_ON
#undef                       TX_ARET_ON
#undef                       RX_ON_NOCLK
#undef                       RX_AACK_ON_NOCLK
#undef                       BUSY_RX_AACK_NOCLK
#undef                       STATE_TRANSITION_IN_PROGRESS
#undef                       CMD_NOP
#undef                       CMD_TX_START
#undef                       CMD_FORCE_TRX_OFF
#undef                       CMD_FORCE_PLL_ON
#undef                       CMD_RX_ON
#undef                       CMD_TRX_OFF
#undef                       CMD_PLL_ON
#undef                       CMD_RX_AACK_ON
#undef                       CMD_TX_ARET_ON
#undef                       TRAC_SUCCESS
#undef                       TRAC_SUCCESS_DATA_PENDING
#undef                       TRAC_SUCCESS_WAIT_FOR_ACK
#undef                       TRAC_CHANNEL_ACCESS_FAILURE
#undef                       TRAC_NO_ACK
#undef                       TRAC_INVALID

/** Important parameters. */
/* TRX Parameter: Bit mask of transceiver supported channel */
#define TRX_SUPPORTED_CHANNELS                             (0x07FFF800)

/*
 * TRX Parameter: Tolerance of the phyTransmitPower PIB attribute. This is
 * encoded into the two
 * MSBits of the attribute, and is effectively read-only.
 */
#define TX_PWR_TOLERANCE                                   (0x80)

/** Typical timing values. */
/* TRX Parameter: t10 */
#define RST_PULSE_WIDTH_US                                 (1)
/* TRX Parameter: tTR1 typical value */
#define P_ON_TO_CLKM_AVAILABLE_TYP_US                      (380)
/* TRX Parameter: tTR1 max. value */
#define P_ON_TO_CLKM_AVAILABLE_MAX_US                      (1000)
/* TRX Parameter: tTR2 typical value */
#define SLEEP_TO_TRX_OFF_TYP_US                            (240)
/* TRX Parameter: tTR2 max. value */
#define SLEEP_TO_TRX_OFF_MAX_US                            (1000)
/* TRX Parameter: tTR3 */
#define TRX_OFF_TO_SLEEP_TIME_CLKM_CYCLES                  (35)
/* TRX Parameter: tTR4 */
#define TRX_OFF_TO_PLL_ON_TIME_US                          (110)
/* TRX Parameter: tTR13 typical value */
#define RESET_TO_TRX_OFF_TYP_US                            (37)
/* TRX Parameter: TRX Parameter: tTR13 max. value */
#define RESET_TO_TRX_OFF_MAX_US                            (1000)
/* TRX Parameter: tIRQ */
#define TRX_IRQ_DELAY_US                                   (9)
/* TRX Parameter: IRQ processing delay */
#define IRQ_PROCESSING_DLY_US                              (32)

/** CSMA timimg parameters */
/* TRX Parameter: CSMA timimg parameters */
#define CCA_DETECTION_TIME_SYM                             (8)
/* TRX Parameter: RSSIBASE_VAL */
#define RSSI_BASE_VAL_DBM                                  (-90)
/* TRX Parameter: CCA processing time in symbols */
#define CCA_PROCESS_TIME_SYM                               (1)
/* TRX Parameter: Complete CCA Duration in symbols */
#define CCA_DURATION_SYM                                   ( \
		CCA_DETECTION_TIME_SYM + CCA_PROCESS_TIME_SYM)
/* TRX Parameter: Preparation time for CCA */
#define CCA_PREPARATION_DURATION_US                        (50)
/* TRX Parameter: Duration before start of CCA */
#define CCA_PRE_START_DURATION_US                          (20)
/* TRX Parameter: 16 us processing delay + 16 us software handling duration */
#define PRE_TX_DURATION_US                                 (32)

/** Register addresses */

/** Offset for register IRQ_MASK1 */
#define RG_IRQ_MASK1                    (0xBE)
/** Sub-registers of Register @ref RG_IRQ_MASK1 */

/** Access parameters for sub-register TX_START_EN in register @ref RG_IRQ_MASK1
**/
#define SR_TX_START_EN                  0xBE, 0x01, 0

/** Access parameters for sub-register MAF_0_AMI_EN in register @ref
 * RG_IRQ_MASK1 */
#define SR_MAF_0_AMI_EN                 0xBE, 0x02, 1

/** Access parameters for sub-register MAF_1_AMI_EN in register @ref
 * RG_IRQ_MASK1 */
#define SR_MAF_1_AMI_EN                 0xBE, 0x04, 2

