avrxml/asf/thirdparty/wireless/avr2025_mac/source/tal/atmegarfr2/inc/atmega256rfr2.h
/** Access parameters for sub-register MAF_2_AMI_EN in register @ref
 * RG_IRQ_MASK1 */
#define SR_MAF_2_AMI_EN                 0xBE, 0x08, 3

/** Access parameters for sub-register MAF_3_AMI_EN in register @ref
 * RG_IRQ_MASK1 */
#define SR_MAF_3_AMI_EN                 0xBE, 0x10, 4

/** Offset for register IRQ_STATUS1 */
#define RG_IRQ_STATUS1                  (0xBF)
/** Sub-registers of Register @ref RG_IRQ_STATUS1 */

/** Access parameters for sub-register TX_START in register @ref RG_IRQ_STATUS1
**/
#define SR_TX_START                     0xBF, 0x01, 0

/** Access parameters for sub-register MAF_0_AMI in register @ref RG_IRQ_STATUS1
**/
#define SR_MAF_0_AMI                    0xBF, 0x02, 1

/** Access parameters for sub-register MAF_1_AMI in register @ref RG_IRQ_STATUS1
**/
#define SR_MAF_1_AMI                    0xBF, 0x04, 2

/** Access parameters for sub-register MAF_2_AMI in register @ref RG_IRQ_STATUS1
**/
#define SR_MAF_2_AMI                    0xBF, 0x08, 3

/** Access parameters for sub-register MAF_3_AMI in register @ref RG_IRQ_STATUS1
**/
#define SR_MAF_3_AMI                    0xBF, 0x10, 4

/** Offset for register MAFCR0 */
#define RG_MAFCR0                       (0x10C)
/** Sub-registers of Register @ref RG_MAFCR0 */
/** Access parameters for sub-register MAF0EN in register @ref RG_MAFCR0 */
#define SR_MAF0EN                       0x10C, 0x01, 0
/** Access parameters for sub-register MAF1EN in register @ref RG_MAFCR0 */
#define SR_MAF1EN                       0x10C, 0x02, 1
/** Access parameters for sub-register MAF2EN in register @ref RG_MAFCR0 */
#define SR_MAF2EN                       0x10C, 0x04, 2
/** Access parameters for sub-register MAF3EN in register @ref RG_MAFCR0 */
#define SR_MAF3EN                       0x10C, 0x08, 3

/** Offset for register MAFCR1 */
#define RG_MAFCR1                       (0x10D)
/** Sub-registers of Register @ref RG_MAFCR1 */

/** Access parameters for sub-register AACK_0_I_AM_COORD in register @ref
 * RG_MAFCR1 */
#define SR_AACK_0_I_AM_COORD            0x10D, 0x01, 0

/** Access parameters for sub-register AACK_0_SET_PD in register @ref RG_MAFCR1
**/
#define SR_AACK_0_SET_PD                0x10D, 0x02, 1

/** Access parameters for sub-register AACK_1_I_AM_COORD in register @ref
 * RG_MAFCR1 */
#define SR_AACK_1_I_AM_COORD            0x10D, 0x04, 2

/** Access parameters for sub-register AACK_1_SET_PD in register @ref RG_MAFCR1
**/
#define SR_AACK_1_SET_PD                0x10D, 0x08, 3

/** Access parameters for sub-register AACK_2_I_AM_COORD in register @ref
 * RG_MAFCR1 */
#define SR_AACK_2_I_AM_COORD            0x10D, 0x10, 4

/** Access parameters for sub-register AACK_2_SET_PD in register @ref RG_MAFCR1
**/
#define SR_AACK_2_SET_PD                0x10D, 0x20, 5

/** Access parameters for sub-register AACK_3_I_AM_COORD in register @ref
 * RG_MAFCR1 */
#define SR_AACK_3_I_AM_COORD            0x10D, 0x40, 6

/** Access parameters for sub-register AACK_3_SET_PD in register @ref RG_MAFCR1
**/
#define SR_AACK_3_SET_PD                0x10D, 0x80, 7

/** Offset for register MAFSA0L */
#define RG_MAFSA0L                      (0x10E)

/** Offset for register MAFSA0H */
#define RG_MAFSA0H                      (0x10F)

/** Offset for register MAFPA0L */
#define RG_MAFPA0L                      (0x110)

/** Offset for register MAFPA0H */
#define RG_MAFPA0H                      (0x111)

/** Offset for register MAFSA1L */
#define RG_MAFSA1L                      (0x112)

/** Offset for register MAFSA1H */
#define RG_MAFSA1H                      (0x113)

/** Offset for register MAFPA1L */
#define RG_MAFPA1L                      (0x114)

/** Offset for register MAFPA1H */
#define RG_MAFPA1H                      (0x115)

/** Offset for register MAFSA2L */
#define RG_MAFSA2L                      (0x116)

/** Offset for register MAFSA2H */
#define RG_MAFSA2H                      (0x117)

/** Offset for register MAFPA2L */
#define RG_MAFPA2L                      (0x118)

/** Offset for register MAFPA2H */
#define RG_MAFPA2H                      (0x119)

/** Offset for register MAFSA3L */
#define RG_MAFSA3L                      (0x11A)

/** Offset for register MAFSA3H */
#define RG_MAFSA3H                      (0x11B)

/** Offset for register MAFPA3L */
#define RG_MAFPA3L                      (0x11C)

/** Offset for register MAFPA3H */
#define RG_MAFPA3H                      (0x11D)

/** Offset for register PARCR */
#define RG_PARCR                        (0x138)
/** Sub-registers of Register @ref RG_PARCR */
/** Access parameters for sub-register PARUFI in register @ref RG_PARCR */
#define SR_PARUFI                       0x138, 0x01, 0
/** Access parameters for sub-register PARDFI in register @ref RG_PARCR */
#define SR_PARDFI                       0x138, 0x02, 1
/** Access parameters for sub-register PALTU in register @ref RG_PARCR */
#define SR_PALTU                        0x138, 0x1C, 2
/** Access parameters for sub-register PALTD in register @ref RG_PARCR */
#define SR_PALTD                        0x138, 0xE0, 5

/** Offset for register AES_CTRL */
#define RG_AES_CTRL                     (0x13C)
/** Sub-registers of Register @ref RG_AES_CTRL */
/** Access parameters for sub-register AES_IM in register @ref RG_AES_CTRL */
#define SR_AES_IM                       0x13C, 0x04, 2
/** Access parameters for sub-register AES_DIR in register @ref RG_AES_CTRL */
#define SR_AES_DIR                      0x13C, 0x08, 3

/** Constant AES_DIR_DECRYPT for sub-register @ref SR_AES_DIR in register
 * AES_CTRL */
#define AES_DIR_DECRYPT                 (1)

/** Constant AES_DIR_ENCRYPT for sub-register @ref SR_AES_DIR in register
 * AES_CTRL */
#define AES_DIR_ENCRYPT                 (0)
/** Access parameters for sub-register AES_MODE in register @ref RG_AES_CTRL */
#define SR_AES_MODE                     0x13C, 0x20, 5

/** Access parameters for sub-register AES_REQUEST in register @ref RG_AES_CTRL
**/
#define SR_AES_REQUEST                  0x13C, 0x80, 7

/** Constant AES_START for sub-register @ref SR_AES_REQUEST in register AES_CTRL
**/
#define AES_START                       (1)

/** Offset for register AES_STATUS */
#define RG_AES_STATUS                   (0x13D)
/** Sub-registers of Register @ref RG_AES_STATUS */

/** Access parameters for sub-register AES_DONE in register @ref RG_AES_STATUS
**/
#define SR_AES_DONE                     0x13D, 0x01, 0

/** Constant AES_COMPLETED for sub-register @ref SR_AES_DONE in register
 * AES_STATUS */
#define AES_COMPLETED                   (1)

/** Constant AES_NOT_COMPLETED for sub-register @ref SR_AES_DONE in register
 * AES_STATUS */
#define AES_NOT_COMPLETED               (0)
/** Access parameters for sub-register AES_ER in register @ref RG_AES_STATUS */
#define SR_AES_ER                       0x13D, 0x80, 7

