avrxml/asf/thirdparty/wireless/avr2025_mac/source/tal/atmegarfr2/inc/atmega256rfr2.h
/** Offset for register AES_STATE */
#define RG_AES_STATE                    (0x13E)

/** Offset for register AES_KEY */
#define RG_AES_KEY                      (0x13F)

/** Offset for register TRX_STATUS */
#define RG_TRX_STATUS                   (0x141)
/** Sub-registers of Register @ref RG_TRX_STATUS */

/** Access parameters for sub-register TRX_STATUS in register @ref RG_TRX_STATUS
**/
#define SR_TRX_STATUS                   0x141, 0x1F, 0

/** Access parameters for sub-register TST_STATUS in register @ref RG_TRX_STATUS
**/
#define SR_TST_STATUS                   0x141, 0x20, 5

/** Access parameters for sub-register CCA_STATUS in register @ref RG_TRX_STATUS
**/
#define SR_CCA_STATUS                   0x141, 0x40, 6

/** Constant CCA_CH_BUSY for sub-register @ref SR_CCA_STATUS in register
 * TRX_STATUS */
#define CCA_CH_BUSY                     (0)

/** Constant CCA_CH_IDLE for sub-register @ref SR_CCA_STATUS in register
 * TRX_STATUS */
#define CCA_CH_IDLE                     (1)

/** Access parameters for sub-register CCA_DONE in register @ref RG_TRX_STATUS
**/
#define SR_CCA_DONE                     0x141, 0x80, 7

/** Constant CCA_COMPLETED for sub-register @ref SR_CCA_DONE in register
 * TRX_STATUS */
#define CCA_COMPLETED                   (1)

/** Constant CCA_NOT_COMPLETED for sub-register @ref SR_CCA_DONE in register
 * TRX_STATUS */
#define CCA_NOT_COMPLETED               (0)

/** Offset for register TRX_STATE */
#define RG_TRX_STATE                    (0x142)
/** Sub-registers of Register @ref RG_TRX_STATE */
/** Access parameters for sub-register TRX_CMD in register @ref RG_TRX_STATE */
#define SR_TRX_CMD                      0x142, 0x1F, 0

/** Access parameters for sub-register TRAC_STATUS in register @ref RG_TRX_STATE
**/
#define SR_TRAC_STATUS                  0x142, 0xE0, 5

/** Offset for register TRX_CTRL_0 */
#define RG_TRX_CTRL_0                   (0x143)
/** Sub-registers of Register @ref RG_TRX_CTRL_0 */

/** Access parameters for sub-register PMU_IF_INV in register @ref RG_TRX_CTRL_0
**/
#define SR_PMU_IF_INV                   0x143, 0x10, 4

/** Access parameters for sub-register PMU_START in register @ref RG_TRX_CTRL_0
**/
#define SR_PMU_START                    0x143, 0x20, 5
/** Access parameters for sub-register PMU_EN in register @ref RG_TRX_CTRL_0 */
#define SR_PMU_EN                       0x143, 0x40, 6

/** Offset for register TRX_CTRL_1 */
#define RG_TRX_CTRL_1                   (0x144)
/** Sub-registers of Register @ref RG_TRX_CTRL_1 */

/** Access parameters for sub-register PLL_TX_FLT in register @ref RG_TRX_CTRL_1
**/
#define SR_PLL_TX_FLT                   0x144, 0x10, 4

/** Access parameters for sub-register TX_AUTO_CRC_ON in register @ref
 * RG_TRX_CTRL_1 */
#define SR_TX_AUTO_CRC_ON               0x144, 0x20, 5

/** Constant TX_AUTO_CRC_DISABLE for sub-register @ref SR_TX_AUTO_CRC_ON in
 * register TRX_CTRL_1 */
#define TX_AUTO_CRC_DISABLE             (0)

/** Constant TX_AUTO_CRC_ENABLE for sub-register @ref SR_TX_AUTO_CRC_ON in
 * register TRX_CTRL_1 */
#define TX_AUTO_CRC_ENABLE              (1)

/** Access parameters for sub-register IRQ_2_EXT_EN in register @ref
 * RG_TRX_CTRL_1 */
#define SR_IRQ_2_EXT_EN                 0x144, 0x40, 6

/** Access parameters for sub-register PA_EXT_EN in register @ref RG_TRX_CTRL_1
**/
#define SR_PA_EXT_EN                    0x144, 0x80, 7

/** Offset for register PHY_TX_PWR */
#define RG_PHY_TX_PWR                   (0x145)
/** Sub-registers of Register @ref RG_PHY_TX_PWR */
/** Access parameters for sub-register TX_PWR in register @ref RG_PHY_TX_PWR */
#define SR_TX_PWR                       0x145, 0x0F, 0

/** Offset for register PHY_RSSI */
#define RG_PHY_RSSI                     (0x146)
/** Sub-registers of Register @ref RG_PHY_RSSI */
/** Access parameters for sub-register RSSI in register @ref RG_PHY_RSSI */
#define SR_RSSI                         0x146, 0x1F, 0
/** Access parameters for sub-register RND_VALUE in register @ref RG_PHY_RSSI */
#define SR_RND_VALUE                    0x146, 0x60, 5

/** Access parameters for sub-register RX_CRC_VALID in register @ref RG_PHY_RSSI
**/
#define SR_RX_CRC_VALID                 0x146, 0x80, 7

/** Constant CRC16_NOT_VALID for sub-register @ref SR_RX_CRC_VALID in register
 * PHY_RSSI */
#define CRC16_NOT_VALID                 (0)

/** Constant CRC16_VALID for sub-register @ref SR_RX_CRC_VALID in register
 * PHY_RSSI */
#define CRC16_VALID                     (1)

/** Offset for register PHY_ED_LEVEL */
#define RG_PHY_ED_LEVEL                 (0x147)

/** Offset for register PHY_CC_CCA */
#define RG_PHY_CC_CCA                   (0x148)
/** Sub-registers of Register @ref RG_PHY_CC_CCA */
/** Access parameters for sub-register CHANNEL in register @ref RG_PHY_CC_CCA */
#define SR_CHANNEL                      0x148, 0x1F, 0

/** Access parameters for sub-register CCA_MODE in register @ref RG_PHY_CC_CCA
**/
#define SR_CCA_MODE                     0x148, 0x60, 5

/** Constant CCA_MODE_0 for sub-register @ref SR_CCA_MODE in register PHY_CC_CCA
**/
#define CCA_MODE_0                      (0)

/** Constant CCA_MODE_1 for sub-register @ref SR_CCA_MODE in register PHY_CC_CCA
**/
#define CCA_MODE_1                      (1)

/** Constant CCA_MODE_2 for sub-register @ref SR_CCA_MODE in register PHY_CC_CCA
**/
#define CCA_MODE_2                      (2)

/** Constant CCA_MODE_3 for sub-register @ref SR_CCA_MODE in register PHY_CC_CCA
**/
#define CCA_MODE_3                      (3)

/** Access parameters for sub-register CCA_REQUEST in register @ref
 * RG_PHY_CC_CCA */
#define SR_CCA_REQUEST                  0x148, 0x80, 7

/** Constant CCA_START for sub-register @ref SR_CCA_REQUEST in register
 * PHY_CC_CCA */
#define CCA_START                       (1)

/** Offset for register CCA_THRES */
#define RG_CCA_THRES                    (0x149)
/** Sub-registers of Register @ref RG_CCA_THRES */

/** Access parameters for sub-register CCA_ED_THRES in register @ref
 * RG_CCA_THRES */
#define SR_CCA_ED_THRES                 0x149, 0x0F, 0

/** Access parameters for sub-register CCA_CS_THRES in register @ref
 * RG_CCA_THRES */
#define SR_CCA_CS_THRES                 0x149, 0xF0, 4

