avrxml/asf/thirdparty/wireless/avr2025_mac/source/tal/atmegarfr2/inc/atmega256rfr2.h
/** Offset for register RX_CTRL */
#define RG_RX_CTRL                      (0x14A)
/** Sub-registers of Register @ref RG_RX_CTRL */
/** Access parameters for sub-register PDT_THRES in register @ref RG_RX_CTRL */
#define SR_PDT_THRES                    0x14A, 0x0F, 0

/** Constant THRES_ANT_DIV_DISABLE for sub-register @ref SR_PDT_THRES in
 * register RX_CTRL */
#define THRES_ANT_DIV_DISABLE           (0x7)

/** Constant THRES_ANT_DIV_ENABLE for sub-register @ref SR_PDT_THRES in register
 * RX_CTRL */
#define THRES_ANT_DIV_ENABLE            (0x3)

/** Offset for register SFD_VALUE */
#define RG_SFD_VALUE                    (0x14B)

/** Offset for register TRX_CTRL_2 */
#define RG_TRX_CTRL_2                   (0x14C)
/** Sub-registers of Register @ref RG_TRX_CTRL_2 */

/** Access parameters for sub-register OQPSK_DATA_RATE in register @ref
 * RG_TRX_CTRL_2 */
#define SR_OQPSK_DATA_RATE              0x14C, 0x03, 0

/** Constant RATE_1_MBPS for sub-register @ref SR_OQPSK_DATA_RATE in register
 * TRX_CTRL_2 */
#define RATE_1_MBPS                     (2)

/** Constant RATE_250_KBPS for sub-register @ref SR_OQPSK_DATA_RATE in register
 * TRX_CTRL_2 */
#define RATE_250_KBPS                   (0)

/** Constant RATE_2_MBPS for sub-register @ref SR_OQPSK_DATA_RATE in register
 * TRX_CTRL_2 */
#define RATE_2_MBPS                     (3)

/** Constant RATE_500_KBPS for sub-register @ref SR_OQPSK_DATA_RATE in register
 * TRX_CTRL_2 */
#define RATE_500_KBPS                   (1)

/** Access parameters for sub-register RX_SAFE_MODE in register @ref
 * RG_TRX_CTRL_2 */
#define SR_RX_SAFE_MODE                 0x14C, 0x80, 7

/** Constant RX_SAFE_MODE_DISABLE for sub-register @ref SR_RX_SAFE_MODE in
 * register TRX_CTRL_2 */
#define RX_SAFE_MODE_DISABLE            (0)

/** Constant RX_SAFE_MODE_ENABLE for sub-register @ref SR_RX_SAFE_MODE in
 * register TRX_CTRL_2 */
#define RX_SAFE_MODE_ENABLE             (1)

/** Offset for register ANT_DIV */
#define RG_ANT_DIV                      (0x14D)
/** Sub-registers of Register @ref RG_ANT_DIV */
/** Access parameters for sub-register ANT_CTRL in register @ref RG_ANT_DIV */
#define SR_ANT_CTRL                     0x14D, 0x03, 0

/** Access parameters for sub-register ANT_EXT_SW_EN in register @ref RG_ANT_DIV
**/
#define SR_ANT_EXT_SW_EN                0x14D, 0x04, 2

/** Constant ANT_EXT_SW_DISABLE for sub-register @ref SR_ANT_EXT_SW_EN in
 * register ANT_DIV */
#define ANT_EXT_SW_DISABLE              (0)

/** Constant ANT_EXT_SW_ENABLE for sub-register @ref SR_ANT_EXT_SW_EN in
 * register ANT_DIV */
#define ANT_EXT_SW_ENABLE               (1)
/** Access parameters for sub-register ANT_DIV_EN in register @ref RG_ANT_DIV */
#define SR_ANT_DIV_EN                   0x14D, 0x08, 3

/** Constant ANT_DIV_DISABLE for sub-register @ref SR_ANT_DIV_EN in register
 * ANT_DIV */
#define ANT_DIV_DISABLE                 (0)

/** Constant ANT_DIV_ENABLE for sub-register @ref SR_ANT_DIV_EN in register
 * ANT_DIV */
#define ANT_DIV_ENABLE                  (1)
/** Access parameters for sub-register ANT_SEL in register @ref RG_ANT_DIV */
#define SR_ANT_SEL                      0x14D, 0x80, 7

/** Offset for register IRQ_MASK */
#define RG_IRQ_MASK                     (0x14E)
/** Sub-registers of Register @ref RG_IRQ_MASK */

/** Access parameters for sub-register PLL_LOCK_EN in register @ref RG_IRQ_MASK
**/
#define SR_PLL_LOCK_EN                  0x14E, 0x01, 0

/** Access parameters for sub-register PLL_UNLOCK_EN in register @ref
 * RG_IRQ_MASK */
#define SR_PLL_UNLOCK_EN                0x14E, 0x02, 1

/** Access parameters for sub-register RX_START_EN in register @ref RG_IRQ_MASK
**/
#define SR_RX_START_EN                  0x14E, 0x04, 2
/** Access parameters for sub-register RX_END_EN in register @ref RG_IRQ_MASK */
#define SR_RX_END_EN                    0x14E, 0x08, 3

/** Access parameters for sub-register CCA_ED_DONE_EN in register @ref
 * RG_IRQ_MASK */
#define SR_CCA_ED_DONE_EN               0x14E, 0x10, 4
/** Access parameters for sub-register AMI_EN in register @ref RG_IRQ_MASK */
#define SR_AMI_EN                       0x14E, 0x20, 5
/** Access parameters for sub-register TX_END_EN in register @ref RG_IRQ_MASK */
#define SR_TX_END_EN                    0x14E, 0x40, 6
/** Access parameters for sub-register AWAKE_EN in register @ref RG_IRQ_MASK */
#define SR_AWAKE_EN                     0x14E, 0x80, 7

/** Offset for register IRQ_STATUS */
#define RG_IRQ_STATUS                   (0x14F)
/** Sub-registers of Register @ref RG_IRQ_STATUS */

/** Access parameters for sub-register PLL_LOCK in register @ref RG_IRQ_STATUS
**/
#define SR_PLL_LOCK                     0x14F, 0x01, 0

/** Access parameters for sub-register PLL_UNLOCK in register @ref RG_IRQ_STATUS
**/
#define SR_PLL_UNLOCK                   0x14F, 0x02, 1

/** Access parameters for sub-register RX_START in register @ref RG_IRQ_STATUS
**/
#define SR_RX_START                     0x14F, 0x04, 2
/** Access parameters for sub-register RX_END in register @ref RG_IRQ_STATUS */
#define SR_RX_END                       0x14F, 0x08, 3

/** Access parameters for sub-register CCA_ED_DONE in register @ref
 * RG_IRQ_STATUS */
#define SR_CCA_ED_DONE                  0x14F, 0x10, 4
/** Access parameters for sub-register AMI in register @ref RG_IRQ_STATUS */
#define SR_AMI                          0x14F, 0x20, 5
/** Access parameters for sub-register TX_END in register @ref RG_IRQ_STATUS */
#define SR_TX_END                       0x14F, 0x40, 6
/** Access parameters for sub-register AWAKE in register @ref RG_IRQ_STATUS */
#define SR_AWAKE                        0x14F, 0x80, 7

/** Offset for register VREG_CTRL */
#define RG_VREG_CTRL                    (0x150)
/** Sub-registers of Register @ref RG_VREG_CTRL */
/** Access parameters for sub-register DVDD_OK in register @ref RG_VREG_CTRL */
#define SR_DVDD_OK                      0x150, 0x04, 2

/** Access parameters for sub-register DVREG_EXT in register @ref RG_VREG_CTRL
**/
#define SR_DVREG_EXT                    0x150, 0x08, 3
/** Access parameters for sub-register AVDD_OK in register @ref RG_VREG_CTRL */
#define SR_AVDD_OK                      0x150, 0x40, 6

/** Access parameters for sub-register AVREG_EXT in register @ref RG_VREG_CTRL
**/
#define SR_AVREG_EXT                    0x150, 0x80, 7

