avrxml/asf/thirdparty/wireless/avr2025_mac/source/tal/atmegarfr2/inc/atmega256rfr2.h
/** Offset for register BATMON */
#define RG_BATMON                       (0x151)
/** Sub-registers of Register @ref RG_BATMON */
/** Access parameters for sub-register BATMON_VTH in register @ref RG_BATMON */
#define SR_BATMON_VTH                   0x151, 0x0F, 0
/** Access parameters for sub-register BATMON_HR in register @ref RG_BATMON */
#define SR_BATMON_HR                    0x151, 0x10, 4

/** Constant BATMON_HIGH_RANGE for sub-register @ref SR_BATMON_HR in register
 * BATMON */
#define BATMON_HIGH_RANGE               (1)

/** Constant BATMON_LOW_RANGE for sub-register @ref SR_BATMON_HR in register
 * BATMON */
#define BATMON_LOW_RANGE                (0)
/** Access parameters for sub-register BATMON_OK in register @ref RG_BATMON */
#define SR_BATMON_OK                    0x151, 0x20, 5

/** Constant BATMON_ABOVE_THRES for sub-register @ref SR_BATMON_OK in register
 * BATMON */
#define BATMON_ABOVE_THRES              (1)

/** Constant BATMON_BELOW_THRES for sub-register @ref SR_BATMON_OK in register
 * BATMON */
#define BATMON_BELOW_THRES              (0)
/** Access parameters for sub-register BAT_LOW_EN in register @ref RG_BATMON */
#define SR_BAT_LOW_EN                   0x151, 0x40, 6
/** Access parameters for sub-register BAT_LOW in register @ref RG_BATMON */
#define SR_BAT_LOW                      0x151, 0x80, 7

/** Offset for register XOSC_CTRL */
#define RG_XOSC_CTRL                    (0x152)
/** Sub-registers of Register @ref RG_XOSC_CTRL */

/** Access parameters for sub-register XTAL_TRIM in register @ref RG_XOSC_CTRL
**/
#define SR_XTAL_TRIM                    0x152, 0x0F, 0

/** Access parameters for sub-register XTAL_MODE in register @ref RG_XOSC_CTRL
**/
#define SR_XTAL_MODE                    0x152, 0xF0, 4

/** Offset for register CC_CTRL_0 */
#define RG_CC_CTRL_0                    (0x153)

/** Offset for register CC_CTRL_1 */
#define RG_CC_CTRL_1                    (0x154)
/** Sub-registers of Register @ref RG_CC_CTRL_1 */
/** Access parameters for sub-register CC_BAND in register @ref RG_CC_CTRL_1 */
#define SR_CC_BAND                      0x154, 0x0F, 0

/** Offset for register RX_SYN */
#define RG_RX_SYN                       (0x155)
/** Sub-registers of Register @ref RG_RX_SYN */

/** Access parameters for sub-register RX_PDT_LEVEL in register @ref RG_RX_SYN
**/
#define SR_RX_PDT_LEVEL                 0x155, 0x0F, 0
/** Access parameters for sub-register RX_OVERRIDE in register @ref RG_RX_SYN */
#define SR_RX_OVERRIDE                  0x155, 0x40, 6
/** Access parameters for sub-register RX_PDT_DIS in register @ref RG_RX_SYN */
#define SR_RX_PDT_DIS                   0x155, 0x80, 7

/** Constant RX_DISABLE for sub-register @ref SR_RX_PDT_DIS in register RX_SYN
**/
#define RX_DISABLE                      (1)
/** Constant RX_ENABLE for sub-register @ref SR_RX_PDT_DIS in register RX_SYN */
#define RX_ENABLE                       (0)

/** Offset for register TRX_RPC */
#define RG_TRX_RPC                      (0x156)
/** Sub-registers of Register @ref RG_TRX_RPC */
/** Access parameters for sub-register XAH_RPC_EN in register @ref RG_TRX_RPC */
#define SR_XAH_RPC_EN                   0x156, 0x01, 0

/** Access parameters for sub-register IPAN_RPC_EN in register @ref RG_TRX_RPC
**/
#define SR_IPAN_RPC_EN                  0x156, 0x02, 1
/** Access parameters for sub-register PLL_RPC_EN in register @ref RG_TRX_RPC */
#define SR_PLL_RPC_EN                   0x156, 0x08, 3
/** Access parameters for sub-register PDT_RPC_EN in register @ref RG_TRX_RPC */
#define SR_PDT_RPC_EN                   0x156, 0x10, 4
/** Access parameters for sub-register RX_RPC_EN in register @ref RG_TRX_RPC */
#define SR_RX_RPC_EN                    0x156, 0x20, 5

/** Access parameters for sub-register RX_RPC_CTRL in register @ref RG_TRX_RPC
**/
#define SR_RX_RPC_CTRL                  0x156, 0xC0, 6

/** Offset for register XAH_CTRL_1 */
#define RG_XAH_CTRL_1                   (0x157)
/** Sub-registers of Register @ref RG_XAH_CTRL_1 */

/** Access parameters for sub-register AACK_PROM_MODE in register @ref
 * RG_XAH_CTRL_1 */
#define SR_AACK_PROM_MODE               0x157, 0x02, 1

/** Constant PROM_MODE_DISABLE for sub-register @ref SR_AACK_PROM_MODE in
 * register XAH_CTRL_1 */
#define PROM_MODE_DISABLE               (0)

/** Constant PROM_MODE_ENABLE for sub-register @ref SR_AACK_PROM_MODE in
 * register XAH_CTRL_1 */
#define PROM_MODE_ENABLE                (1)

/** Access parameters for sub-register AACK_ACK_TIME in register @ref
 * RG_XAH_CTRL_1 */
#define SR_AACK_ACK_TIME                0x157, 0x04, 2

/** Constant ACK_TIME_12_SYMBOLS for sub-register @ref SR_AACK_ACK_TIME in
 * register XAH_CTRL_1 */
#define ACK_TIME_12_SYMBOLS             (0)

/** Constant ACK_TIME_2_SYMBOLS for sub-register @ref SR_AACK_ACK_TIME in
 * register XAH_CTRL_1 */
#define ACK_TIME_2_SYMBOLS              (1)

/** Access parameters for sub-register AACK_UPLD_RES_FT in register @ref
 * RG_XAH_CTRL_1 */
#define SR_AACK_UPLD_RES_FT             0x157, 0x10, 4

/** Access parameters for sub-register AACK_FLTR_RES_FT in register @ref
 * RG_XAH_CTRL_1 */
#define SR_AACK_FLTR_RES_FT             0x157, 0x20, 5

/** Offset for register FTN_CTRL */
#define RG_FTN_CTRL                     (0x158)
/** Sub-registers of Register @ref RG_FTN_CTRL */
/** Access parameters for sub-register FTN_START in register @ref RG_FTN_CTRL */
#define SR_FTN_START                    0x158, 0x80, 7

/** Offset for register PLL_CF */
#define RG_PLL_CF                       (0x15A)
/** Sub-registers of Register @ref RG_PLL_CF */

/** Access parameters for sub-register PLL_CF_START in register @ref RG_PLL_CF
**/
#define SR_PLL_CF_START                 0x15A, 0x80, 7

/** Offset for register PLL_DCU */
#define RG_PLL_DCU                      (0x15B)
/** Sub-registers of Register @ref RG_PLL_DCU */

/** Access parameters for sub-register PLL_DCU_START in register @ref RG_PLL_DCU
**/
#define SR_PLL_DCU_START                0x15B, 0x80, 7

/** Offset for register PART_NUM */
#define RG_PART_NUM                     (0x15C)

/** Constant ATMEGARFR2_PART_NUM for sub-register @ref SR_PART_NUM in register
 * PART_NUM */
#define ATMEGARFR2_PART_NUM             (0x94)

/** Offset for register VERSION_NUM */
#define RG_VERSION_NUM                  (0x15D)

/** Offset for register MAN_ID_0 */
#define RG_MAN_ID_0                     (0x15E)

/** Offset for register MAN_ID_1 */
#define RG_MAN_ID_1                     (0x15F)

/** Offset for register SHORT_ADDR_0 */
#define RG_SHORT_ADDR_0                 (0x160)

/** Offset for register SHORT_ADDR_1 */
#define RG_SHORT_ADDR_1                 (0x161)

/** Offset for register PAN_ID_0 */
#define RG_PAN_ID_0                     (0x162)

/** Offset for register PAN_ID_1 */
#define RG_PAN_ID_1                     (0x163)

/** Offset for register IEEE_ADDR_0 */
#define RG_IEEE_ADDR_0                  (0x164)

