avrxml/asf/thirdparty/wireless/avr2025_mac/source/tal/atmegarfr2/inc/atmega256rfr2.h
/** Offset for register IEEE_ADDR_1 */
#define RG_IEEE_ADDR_1                  (0x165)

/** Offset for register IEEE_ADDR_2 */
#define RG_IEEE_ADDR_2                  (0x166)

/** Offset for register IEEE_ADDR_3 */
#define RG_IEEE_ADDR_3                  (0x167)

/** Offset for register IEEE_ADDR_4 */
#define RG_IEEE_ADDR_4                  (0x168)

/** Offset for register IEEE_ADDR_5 */
#define RG_IEEE_ADDR_5                  (0x169)

/** Offset for register IEEE_ADDR_6 */
#define RG_IEEE_ADDR_6                  (0x16A)

/** Offset for register IEEE_ADDR_7 */
#define RG_IEEE_ADDR_7                  (0x16B)

/** Offset for register XAH_CTRL_0 */
#define RG_XAH_CTRL_0                   (0x16C)
/** Sub-registers of Register @ref RG_XAH_CTRL_0 */

/** Access parameters for sub-register SLOTTED_OPERATION in register @ref
 * RG_XAH_CTRL_0 */
#define SR_SLOTTED_OPERATION            0x16C, 0x01, 0

/** Constant SLOTTED_OPERATION_DISABLE for sub-register @ref
 * SR_SLOTTED_OPERATION in register XAH_CTRL_0 */
#define SLOTTED_OPERATION_DISABLE       (0)

/** Constant SLOTTED_OPERATION_EnABLE for sub-register @ref SR_SLOTTED_OPERATION
 * in register XAH_CTRL_0 */
#define SLOTTED_OPERATION_EnABLE        (1)

/** Access parameters for sub-register MAX_CSMA_RETRIES in register @ref
 * RG_XAH_CTRL_0 */
#define SR_MAX_CSMA_RETRIES             0x16C, 0x0E, 1

/** Access parameters for sub-register MAX_FRAME_RETRIES in register @ref
 * RG_XAH_CTRL_0 */
#define SR_MAX_FRAME_RETRIES            0x16C, 0xF0, 4

/** Offset for register CSMA_SEED_0 */
#define RG_CSMA_SEED_0                  (0x16D)

/** Offset for register CSMA_SEED_1 */
#define RG_CSMA_SEED_1                  (0x16E)
/** Sub-registers of Register @ref RG_CSMA_SEED_1 */

/** Access parameters for sub-register CSMA_SEED_1 in register @ref
 * RG_CSMA_SEED_1 */
#define SR_CSMA_SEED_1                  0x16E, 0x07, 0

/** Access parameters for sub-register AACK_I_AM_COORD in register @ref
 * RG_CSMA_SEED_1 */
#define SR_AACK_I_AM_COORD              0x16E, 0x08, 3

/** Constant I_AM_COORD_DISABLE for sub-register @ref SR_AACK_I_AM_COORD in
 * register CSMA_SEED_1 */
#define I_AM_COORD_DISABLE              (0)

/** Constant I_AM_COORD_ENABLE for sub-register @ref SR_AACK_I_AM_COORD in
 * register CSMA_SEED_1 */
#define I_AM_COORD_ENABLE               (1)

/** Access parameters for sub-register AACK_DIS_ACK in register @ref
 * RG_CSMA_SEED_1 */
#define SR_AACK_DIS_ACK                 0x16E, 0x10, 4

/** Constant ACK_DISABLE for sub-register @ref SR_AACK_DIS_ACK in register
 * CSMA_SEED_1 */
#define ACK_DISABLE                     (1)

/** Constant ACK_ENABLE for sub-register @ref SR_AACK_DIS_ACK in register
 * CSMA_SEED_1 */
#define ACK_ENABLE                      (0)

/** Access parameters for sub-register AACK_SET_PD in register @ref
 * RG_CSMA_SEED_1 */
#define SR_AACK_SET_PD                  0x16E, 0x20, 5

/** Constant PD_ACK_BIT_SET_DISABLE for sub-register @ref SR_AACK_SET_PD in
 * register CSMA_SEED_1 */
#define PD_ACK_BIT_SET_DISABLE          (0)

/** Constant PD_ACK_BIT_SET_ENABLE for sub-register @ref SR_AACK_SET_PD in
 * register CSMA_SEED_1 */
#define PD_ACK_BIT_SET_ENABLE           (1)

/** Access parameters for sub-register AACK_FVN_MODE in register @ref
 * RG_CSMA_SEED_1 */
#define SR_AACK_FVN_MODE                0x16E, 0xC0, 6

/** Constant FRAME_VERSION_0 for sub-register @ref SR_AACK_FVN_MODE in register
 * CSMA_SEED_1 */
#define FRAME_VERSION_0                 (0)

/** Constant FRAME_VERSION_01 for sub-register @ref SR_AACK_FVN_MODE in register
 * CSMA_SEED_1 */
#define FRAME_VERSION_01                (1)

/** Constant FRAME_VERSION_012 for sub-register @ref SR_AACK_FVN_MODE in
 * register CSMA_SEED_1 */
#define FRAME_VERSION_012               (2)

/** Constant FRAME_VERSION_IGNORED for sub-register @ref SR_AACK_FVN_MODE in
 * register CSMA_SEED_1 */
#define FRAME_VERSION_IGNORED           (3)

/** Offset for register CSMA_BE */
#define RG_CSMA_BE                      (0x16F)
/** Sub-registers of Register @ref RG_CSMA_BE */
/** Access parameters for sub-register MIN_BE in register @ref RG_CSMA_BE */
#define SR_MIN_BE                       0x16F, 0x0F, 0
/** Access parameters for sub-register MAX_BE in register @ref RG_CSMA_BE */
#define SR_MAX_BE                       0x16F, 0xF0, 4

/** Offset for register TST_CTRL_DIGI */
#define RG_TST_CTRL_DIGI                (0x176)
/** Sub-registers of Register @ref RG_TST_CTRL_DIGI */

/** Access parameters for sub-register TST_CTRL_DIG in register @ref
 * RG_TST_CTRL_DIGI */
#define SR_TST_CTRL_DIG                 0x176, 0x0F, 0

/** Offset for register TST_RX_LENGTH */
#define RG_TST_RX_LENGTH                (0x17B)

/** Offset for register TRXFBST */
#define RG_TRXFBST                      (0x180)

/** Offset for register TRXFBEND */
#define RG_TRXFBEND                     (0x1FF)

/** Enumerations */

/** Transceiver states */
typedef enum tal_trx_status_tag {
	/** Constant P_ON for sub-register @ref SR_TRX_STATUS */
	P_ON =                              (0x00),

	/** Constant BUSY_RX for sub-register @ref SR_TRX_STATUS */
	BUSY_RX =                           (0x01),

	/** Constant BUSY_TX for sub-register @ref SR_TRX_STATUS */
	BUSY_TX =                           (0x02),

	/** Constant RX_ON for sub-register @ref SR_TRX_STATUS */
	RX_ON =                             (0x06),

	/** Constant TRX_OFF for sub-register @ref SR_TRX_STATUS */
	TRX_OFF =                           (0x08),

	/** Constant PLL_ON for sub-register @ref SR_TRX_STATUS */
	PLL_ON =                            (0x09),

	/** Constant TRX_SLEEP for sub-register @ref SR_TRX_STATUS */
	TRX_SLEEP =                         (0x0F),

	/** Constant BUSY_RX_AACK for sub-register @ref SR_TRX_STATUS */
	BUSY_RX_AACK =                      (0x11),

	/** Constant BUSY_TX_ARET for sub-register @ref SR_TRX_STATUS */
	BUSY_TX_ARET =                      (0x12),

	/** Constant RX_AACK_ON for sub-register @ref SR_TRX_STATUS */
	RX_AACK_ON =                        (0x16),

	/** Constant TX_ARET_ON for sub-register @ref SR_TRX_STATUS */
	TX_ARET_ON =                        (0x19),

	/** Constant RX_ON_NOCLK for sub-register @ref SR_TRX_STATUS */
	RX_ON_NOCLK =                       (0x1C),

	/** Constant RX_AACK_ON_NOCLK for sub-register @ref SR_TRX_STATUS */
	RX_AACK_ON_NOCLK =                  (0x1D),

	/** Constant BUSY_RX_AACK_NOCLK for sub-register @ref SR_TRX_STATUS */
	BUSY_RX_AACK_NOCLK =                (0x1E),

	/** Constant STATE_TRANSITION_IN_PROGRESS for sub-register @ref
	 * SR_TRX_STATUS */
	STATE_TRANSITION_IN_PROGRESS =      (0x1F)
} SHORTENUM tal_trx_status_t;

